load-tests/result.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 40s max duration (incl. graceful stop):
              * flash_sale_spike: 1000 looping VUs for 10s (gracefulStop: 30s)


running (00.7s), 1000/1000 VUs, 11 complete and 0 interrupted iterations
flash_sale_spike   [   7% ] 1000 VUs  00.7s/10s

running (01.7s), 1000/1000 VUs, 843 complete and 0 interrupted iterations
flash_sale_spike   [  17% ] 1000 VUs  01.7s/10s

running (02.7s), 1000/1000 VUs, 1967 complete and 0 interrupted iterations
flash_sale_spike   [  27% ] 1000 VUs  02.7s/10s

running (03.7s), 1000/1000 VUs, 2771 complete and 0 interrupted iterations
flash_sale_spike   [  37% ] 1000 VUs  03.7s/10s

running (04.7s), 1000/1000 VUs, 4018 complete and 0 interrupted iterations
flash_sale_spike   [  47% ] 1000 VUs  04.7s/10s

running (05.7s), 1000/1000 VUs, 4957 complete and 0 interrupted iterations
flash_sale_spike   [  57% ] 1000 VUs  05.7s/10s

running (06.7s), 1000/1000 VUs, 6122 complete and 0 interrupted iterations
flash_sale_spike   [  67% ] 1000 VUs  06.7s/10s

running (07.7s), 1000/1000 VUs, 7079 complete and 0 interrupted iterations
flash_sale_spike   [  77% ] 1000 VUs  07.7s/10s

running (08.7s), 1000/1000 VUs, 7958 complete and 0 interrupted iterations
flash_sale_spike   [  87% ] 1000 VUs  08.7s/10s

running (09.7s), 1000/1000 VUs, 8880 complete and 0 interrupted iterations
flash_sale_spike   [  97% ] 1000 VUs  09.7s/10s

running (10.7s), 0048/1000 VUs, 10100 complete and 0 interrupted iterations
flash_sale_spike ↓ [ 100% ] 1000 VUs  10s


  █ THRESHOLDS 

    http_req_duration
    ✗ 'p(95)<500' p(95)=984.44ms

    http_req_failed
    ✗ 'rate<0.01' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 40592  3748.12697/s
    checks_succeeded...: 24.87% 10099 out of 40592
    checks_failed......: 75.12% 30493 out of 40592

    ✗ is success (200)
      ↳  0% — ✓ 0 / ✗ 10148
    ✗ is out of stock/conflict (409)
      ↳  0% — ✓ 0 / ✗ 10148
    ✗ is rate limited (429)
      ↳  99% — ✓ 10099 / ✗ 49
    ✗ is server error (500)
      ↳  0% — ✓ 0 / ✗ 10148

    HTTP
    http_req_duration....: avg=653.51ms min=97.75ms  med=649.27ms max=1.22s p(90)=927.58ms p(95)=984.44ms
    http_req_failed......: 100.00% 10148 out of 10148
    http_reqs............: 10148   937.031743/s

    EXECUTION
    iteration_duration...: avg=996.59ms min=303.82ms med=984.2ms  max=2.61s p(90)=1.29s    p(95)=1.38s   
    iterations...........: 10148   937.031743/s
    vus..................: 48      min=48             max=1000
    vus_max..............: 1000    min=1000           max=1000

    NETWORK
    data_received........: 4.1 MB  381 kB/s
    data_sent............: 3.4 MB  313 kB/s



running (10.8s), 0000/1000 VUs, 10148 complete and 0 interrupted iterations
flash_sale_spike ✓ [ 100% ] 1000 VUs  10s
time="2026-07-11T09:26:14Z" level=error msg="thresholds on metrics 'http_req_duration, http_req_failed' have been crossed"