load-tests/result3.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 40s max duration (incl. graceful stop):
              * flash_sale_spike: 10 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 26 complete and 0 interrupted iterations
flash_sale_spike   [  10% ] 10 VUs  01.0s/10s

running (02.0s), 10/10 VUs, 57 complete and 0 interrupted iterations
flash_sale_spike   [  20% ] 10 VUs  02.0s/10s

running (03.0s), 10/10 VUs, 87 complete and 0 interrupted iterations
flash_sale_spike   [  30% ] 10 VUs  03.0s/10s

running (04.0s), 10/10 VUs, 121 complete and 0 interrupted iterations
flash_sale_spike   [  40% ] 10 VUs  04.0s/10s

running (05.0s), 10/10 VUs, 154 complete and 0 interrupted iterations
flash_sale_spike   [  50% ] 10 VUs  05.0s/10s

running (06.0s), 10/10 VUs, 188 complete and 0 interrupted iterations
flash_sale_spike   [  60% ] 10 VUs  06.0s/10s

running (07.0s), 10/10 VUs, 219 complete and 0 interrupted iterations
flash_sale_spike   [  70% ] 10 VUs  07.0s/10s

running (08.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
flash_sale_spike   [  80% ] 10 VUs  08.0s/10s

running (09.0s), 10/10 VUs, 284 complete and 0 interrupted iterations
flash_sale_spike   [  90% ] 10 VUs  09.0s/10s

running (10.0s), 10/10 VUs, 316 complete and 0 interrupted iterations
flash_sale_spike   [ 100% ] 10 VUs  10.0s/10s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=21.26ms

    http_req_failed
    ✗ 'rate<0.05' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 1304   126.880329/s
    checks_succeeded...: 21.24% 277 out of 1304
    checks_failed......: 78.75% 1027 out of 1304

    ✗ is success (200)
      ↳  0% — ✓ 0 / ✗ 326
    ✗ is out of stock/conflict (409)
      ↳  0% — ✓ 0 / ✗ 326
    ✗ is rate limited (429)
      ↳  84% — ✓ 277 / ✗ 49
    ✗ is server error (500)
      ↳  0% — ✓ 0 / ✗ 326

    HTTP
    http_req_duration....: avg=8.35ms   min=2.29ms   med=5.55ms   max=89.44ms  p(90)=16.01ms  p(95)=21.26ms 
    http_req_failed......: 100.00% 326 out of 326
    http_reqs............: 326     31.720082/s

    EXECUTION
    iteration_duration...: avg=311.66ms min=107.59ms med=307.54ms max=539.66ms p(90)=472.42ms p(95)=499.01ms
    iterations...........: 326     31.720082/s
    vus..................: 10      min=10         max=10
    vus_max..............: 10      min=10         max=10

    NETWORK
    data_received........: 126 kB  12 kB/s
    data_sent............: 109 kB  11 kB/s



running (10.3s), 00/10 VUs, 326 complete and 0 interrupted iterations
flash_sale_spike ✓ [ 100% ] 10 VUs  10s
time="2026-07-11T09:29:30Z" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"